{
  "total_complaints": 46,
  "unique_issues": 38,
  "device_types": {
    "All devices": 8,
    "Mobile devices": 5,
    "Router": 4,
    "Mobile Device": 4,
    "Dongle": 4,
    "Mobitel device": 3,
    "Mobile device": 3,
    "S10 router": 2,
    "POS Machine": 2,
    "ZLT M30 Pocket routers": 2,
    "Huawei Router": 1,
    "-": 1,
    "ZLT M30 Pocket router": 1,
    "Unknown device": 1,
    "Smart Phones": 1,
    "Smart Phone": 1,
    "S10 router SIM connection": 1,
    "B311 router": 1,
    "Mobile Phone": 1
  },
  "common_issues": {
    "data": 14,
    "signal": 7,
    "call": 7,
    "coverage": 4,
    "voice": 4,
    "connection": 2,
    "network": 2
  },
  "signal_issues": {
    "weak_signal_complaints": 0
  },
  "district_analysis": {
    "CO": 8,
    "KY": 4,
    "KL": 3,
    "ML": 2,
    "KU": 1,
    "NU": 1,
    "PT": 1,
    "GM": 1,
    "MO": 1,
    "KG": 1
  },
  "solution_patterns": {
    "There were cell unavailabilities in the site, Clear the alarms solved the issue": 3,
    "New Site (Dialog Sharing)": 2,
    "Need repeater solution, survey arranged": 2,
    "For more analysis vist arranged": 2,
    "Standard troubleshooting required": 2,
    "Dongle device issue": 2,
    "KLPET1 Site on aired and solved": 1,
    "Sudden Issue": 1,
    "Cx used Zcaler VPN/Lock 4G  ": 1,
    "2G/4G pico repeter": 1,
    "Direct BTS team to rectify": 1,
    "Enabling VoLTE ": 1,
    "The nearest site isn't covering the area checked using viewshed, so power increase in the site to max values.": 1,
    "Visited and found as a POS machine issue": 1,
    "The mobile network mode was set to 2G/3G mode after enabling LTE mode in mobile device solved the issue": 1,
    "Changing the router location solved the issue": 1,
    "VOLTE Enable": 1,
    "Serving cell power increase to enhance the coverage": 1,
    "Enabling Vo-LTE  and Vo-WIFI": 1,
    "The customer uses two separate VPNs for their office work. They have noted that while their data speed is good without a VPN, it drops significantly when a VPN is in use. So the issue is related to their VPN connections": 1,
    "Power incresed of the site (Not resolved) Solution - Repeater": 1,
    "Need coverage improvement plan (visited and checked)": 1,
    "Need 4G coverage improvement plan.  Already planned a new site( 6.874391, 79.96332) ": 1,
    "Small cell relocation": 1,
    "Because of the rain the coverage is varying, cell power is already increased": 1,
    "IBS extension for 33BC floor, Good coverage observed where IBS is implemented (41 and 43)": 1,
    "POS machine is getting randomly offline for some period. So a visit arranged for on site analysis": 1,
    "Direct BTS team to rectify battery Backup": 1,
    "Coudln't test the SIM cause, it is a micro sim so visit arranged": 1,
    "After contacting and checking with customer mentioned that the issue is with the Airtel connection. (There are no Mobitel service issue other customers in the area confirmed)": 1,
    "Data bundle was over and renewed on 25th Aug. Then gave a reset after that issue solved": 1,
    "Enable TMPCORP APN": 1,
    "Enabling Vo-LTE  and Vo-WIFI. (As there is a wifi unit at the location)": 1,
    "Cx didn't mentioned the time, no issue with coverage or IBS": 1,
    "Visited and checked the coverage, from visit observed no IBS antenna in the area. So need IBS extension for New Banquet office. To the City club building previously visited and proposed an IBS, the solution in approval process": 1,
    "Device Issue. Proposed to change the device.": 1,
    "Only a onnection is not working, other connections are working. So need to check and replace a SIM": 1,
    "Visited and proposed external antenna": 1,
    "Direct team to clear VSWR alarm": 1
  }
}