{
  "categories": [
    "indoor_coverage",
    "general_technical",
    "voice_call",
    "device_hardware",
    "data_coverage",
    "site_infrastructure"
  ],
  "solution_mappings": {
    "sudden voice call issue for all devices mobile devices abnormal kpis for klpor5 serving cell - klpor5g rsrp -87 to -94 dbm": "There were cell unavailabilities in the site, Clear the alarms solved the issue",
    "sudden coverage drop for all devices huawei router cell unavailability klpet1 no coverage": "KLPET1 Site on aired and solved",
    "voice call drop and clarity mobile device live kpi; no kpi issue serving cell - col100-m-l21-c2 rsrp -98 to -103 dbm": "Enabling VoLTE",
    "data and call issue mobile devices recurrent alarms at qbtpp1 good": "Direct BTS team to rectify",
    "inside the building experiencing poor coverage, making it difficult to use mobitel services. this is a long-standing issue all devices no issue serving cell - kyhal1-m-l85-c1 rsrp -111 to -114 dbm": "2G/4G pico repeter",
    "internet acess issue from pockect router not  specific location router no issue serving cell-col485h rsrp(dbm)-75-77": "Cx used Zcaler VPN/Lock 4G",
    "call drop  mobile device site down alarm serving cell-kypil1q rx level(dbm)-72-77": "Sudden Issue",
    "cannot browse internet, always no data connection mobile device no issue serving cell col353w rscp -101 to -109 dbm": "The mobile network mode was set to 2G/3G mode after enabling LTE mode in mobile device solved the issue",
    "unable to perform transaction via pos pos machine no issue serving cell - hmmat2-m-l85-b1   rsrp -95dbm": "Visited and found as a POS machine issue",
    "poor mobitel service for long time all devices no issue serving cell - kubad1-m-l85-c1 rsrp -117 to -125 dbm  serving cell - kukur3-m-l85-a1 rsrp -119 to -124 dbm": "The nearest site isn't covering the area checked using viewshed, so power increase in the site to max values.",
    "data/speeds very low only for dongle devices dongle no issue serving cell - kunik1h / kunik1-m-l21-b1 rsrp -91 to -102  dbm": "Dongle device issue",
    "indoor call drop, data speed and coverage issue - live kpi; no issue serving cell - col313i rsrp -117 to -119 dbm": "Power incresed of the site (Not resolved) Solution - Repeater",
    "the connection is not working. router no issue serving cell - nuday1-m-l85-b1 rsrp -120 dbm": "Need coverage improvement plan (visited and checked)",
    "call issue/ already activated volte/after disable vlote issue is resolved mobile device no issue serving cell-zbat22a rx level(dbm)-66-70": "Need 4G coverage improvement plan.  Already planned a new site( 6.874391, 79.96332)",
    "data and call issue  mobile devices no kpi issue kuwel1 serving cell- kuwel1a rxlev -104 dbm  kuwel1-m-l85-c1  rsrp -119 to -121 dbm": "New Site (Dialog Sharing)",
    "signal levels for the router is degraded s10 router no issue serving cell ibssm1_2-ib-l18-c1 rsrp -79 to -83 dbm": "Changing the router location solved the issue",
    "mobile signal and call issue at the location mobile device no issue serving cell-   ibpkl1h     rsrp(dbm)-79-83": "VOLTE Enable",
    "the customer reported that their data connection was slow for two weeks at both their office and home locations. mobile device no issue serving cell - znug11h rsrp -98 to -104 dbm": "Serving cell power increase to enhance the coverage",
    "indoor call quality issue mobitel device no cell kpi issue col505g  rsrp -95dbm": "Enabling Vo-LTE  and Vo-WIFI",
    "network is slow when using pocket router zlt m30 pocket router no issue serving cell - kydel2-m-l21-b1 rsrp -96 to -99 dbm": "The customer uses two separate VPNs for their office work. They have noted that while their data speed is good without a VPN, it drops significantly when a VPN is in use. So the issue is related to their VPN connections",
    "data and voice is not working at 33bc clear point residence, no issue identified from our end. all devices no issue serving cell - col374g rsrp -95 to -104 dbm": "IBS extension for 33BC floor, Good coverage observed where IBS is implemented (41 and 43)",
    "constantly connection disruption and average speed below 1mbps. router no issue serving cell - kgund1-m-l85-b1 rsrp -100 to -105 dbm": "Because of the rain the coverage is varying, cell power is already increased",
    "small cell relocation request all devices no issue good": "Small cell relocation",
    "unable to perform transactions through pos machines and appearing as offline pos machine no issue serving cell - mt_matale_slt_mlmat3_d3 rsrp -100 to -103 dbm  serving cell - mlmat3g rsrp -103 to -105 dbm": "POS machine is getting randomly offline for some period. So a visit arranged for on site analysis",
    "intermittent connect to lte network dongle no issue no coverage": "Coudln't test the SIM cause, it is a micro sim so visit arranged",
    "no signal during power outages mobitel device cell unavailability iblhh1 good": "Direct BTS team to rectify battery Backup",
    "poor data speed zlt m30 pocket routers no issue serving cell - lcc087g rsrp -99 to -103 dbm  serving cell - lcc086h rsrp -99 to -105 dbm": "For more analysis vist arranged",
    "mobile signal issues (connection drop), difficulties in mobile data and voice mobile device no issue serving cell - ibcol1g rsrp -74 to -77 dbm": "After contacting and checking with customer mentioned that the issue is with the Airtel connection. (There are no Mobitel service issue other customers in the area confirmed)",
    "there is no coverage throughout the bungalow area, an issue they say has been persisting for a long time. all devices no issue serving cell qkyrp2w rscp -100 to -108 dbm": "Need repeater solution, survey arranged",
    "data throughput slow s10 router no issue serving cell - ptnar4-m-l18-b2 rsrp -69 to -72 dbm": "Data bundle was over and renewed on 25th Aug. Then gave a reset after that issue solved",
    "poor data speed dongle high prb observed serving cell -  lgm034-m-l21-b2 rsrp -85 to -89dbm": "Enable TMPCORP APN",
    "call quality issue smart phones no issue zwat01y  rscp -91dbm": "Enabling Vo-LTE  and Vo-WIFI. (As there is a wifi unit at the location)",
    "mobitel signal inside the hotel premises is dropping and returning time to time, due to this we are having call clarity issues and sometimes getting total disconnection as well. all devices no issue serving cell - ibex01h rsrp -90 to -100 dbm": "Cx didn't mentioned the time, no issue with coverage or IBS",
    "there is no mobile signal in some locations inside the hotel, (new banquet office and cinnamon grand hansa city club gym ) low signal, calls are cut, no 4g network. all devices no issue serving cell - ibcol1i rsrp -122 to -128 dbm": "Visited and checked the coverage, from visit observed no IBS antenna in the area. So need IBS extension for New Banquet office. To the City club building previously visited and proposed an IBS, the solution in approval process",
    "poor data speed at every location. sudden become no service smart phone no issue good": "Device Issue. Proposed to change the device.",
    "the mentioned sim is not working. checked the both sim and the device. the device is working properly, and data is not working on sim s10 router sim connection no issue serving cell- motku1h   rsrp -92 to -97dbm": "Only a onnection is not working, other connections are working. So need to check and replace a SIM",
    "wifi low signal b311 router no issue serving cell - nuaga1-m-l85-a1 rsrp -109 to 113 dbm": "Visited and proposed external antenna",
    "indoor call drop, data speed and coverage issue mobitel device no issue serving cell - col313i rsrp -114 to 120 dbm": "New Site (Dialog Sharing)",
    "call quality issue mobile phone vswr alrm observed no coverage observed from trace": "Direct team to clear VSWR alarm"
  },
  "device_patterns": {
    "mobile device": "There were cell unavailabilities in the site, Clear the alarms solved the issue",
    "huawei router": "KLPET1 Site on aired and solved",
    "dongle": "Dongle device issue",
    "s10 router": "Changing the router location solved the issue"
  },
  "site_patterns": {
    "klpor5": "There were cell unavailabilities in the site, Clear the alarms solved the issue",
    "klpet1": "KLPET1 Site on aired and solved"
  },
  "training_date": "2025-09-03T09:46:00.468386",
  "training_samples": 39
}